; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite4)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite4 Phenomenon11)
	(have_image Star5 thermograph0)
	(have_image Star6 image1)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 image1)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 thermograph0)
))

)

; plan
1. (switch_on instrument4 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument4)
   goals met: 0 of 8
2. (calibrate satellite4 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 8
3. (turn_to satellite4 planet10 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet10)
   goals met: 0 of 8
4. (take_image satellite4 planet10 instrument4 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite4 phenomenon9 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 phenomenon9)
   goals met: 1 of 8
6. (take_image satellite4 phenomenon9 instrument4 image1)
   added: (have_image phenomenon9 image1)
   goals met: 2 of 8
7. (turn_to satellite4 phenomenon8 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon8)
   goals met: 2 of 8
8. (take_image satellite4 phenomenon8 instrument4 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 3 of 8
9. (turn_to satellite4 phenomenon7 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon7)
   goals met: 3 of 8
10. (take_image satellite4 phenomenon7 instrument4 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 4 of 8
11. (turn_to satellite4 star5 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star5)
   goals met: 4 of 8
12. (take_image satellite4 star5 instrument4 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 5 of 8
13. (turn_to satellite4 star6 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star6)
   goals met: 5 of 8
14. (take_image satellite4 star6 instrument4 image1)
   added: (have_image star6 image1)
   goals met: 6 of 8
15. (turn_to satellite4 phenomenon11 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 phenomenon11)
   goals met: 7 of 8
16. (take_image satellite4 phenomenon11 instrument4 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 8 of 8
